spec/fixtures/vcr_cassettes/conekta_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://szrMg5UXExCA7JJriEdH:@api.conekta.io/charges?amount=30000&card=tok_test_visa_4242&currency=MXN&description=fake%20test%20product&reference_id=1
    body:
      encoding: UTF-8
      string: ''
    headers:
      User-Agent:
      - Conekta/v1 RubyBindings/0.5.2
      X-Conekta-Client-User-Agent:
      - '{"bindings_version":"0.5.2","lang":"ruby","lang_version":"2.2.0","publisher":"conekta","uname":{"sysname":"Darwin","nodename":"Alejandros-MacBook-Pro-2.local","release":"14.0.0","version":"Darwin
        Kernel Version 14.0.0: Fri Sep 19 00:26:44 PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64","machine":"x86_64","model":"MacBookPro5,5"}}'
      Accept:
      - application/vnd.conekta-v1.0.0+json
      Accept-Language:
      - es
      Content-Length:
      - '0'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Conekta-Media-Type:
      - conekta-v1.0.0; format=json
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sat, 07 Mar 2015 03:02:28 GMT
      Etag:
      - '"1dd523e93b02af24635d3e658f33865c"'
      Server:
      - nginx/1.1.19
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
      X-Request-Id:
      - 0fb139227ec7c8f0de39e6347cbae351
      X-Runtime:
      - '3.811275'
      Content-Length:
      - '642'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"id":"54fa6a4119ce885a57000521","livemode":false,"created_at":1425697345,"status":"paid","currency":"MXN","description":"fake
        test product","reference_id":"1","failure_code":null,"failure_message":null,"monthly_installments":null,"object":"charge","amount":30000,"paid_at":1425697348,"fee":1299,"customer_id":"","refunds":[],"payment_method":{"name":"Jorge
        Lopez","exp_month":"12","exp_year":"19","auth_code":"176804","object":"card_payment","type":"credit","last4":"4242","brand":"visa","issuer":"","account_type":"","country":"US","fraud_score":null,"fraud_indicators":[]},"details":{"name":null,"phone":null,"email":null,"line_items":[]}}'
    http_version: 
  recorded_at: Sat, 07 Mar 2015 03:01:19 GMT
recorded_with: VCR 2.9.3
